# Welcome to this kernel

This is a series of kernels whos main goal is to compile tricks, tutorials and general knowlegde of pandas for future fast reference.

This first kernel (splitted in 3 parts) will contain the solutions for pandas exercises from this website
https://www.machinelearningplus.com/python/101-pandas-exercises-python/

Part one (solution from 1 - 34): https://www.kaggle.com/python10pm/pandas-exercises-with-solutions-1-3

Part two (solution from 35 - 42): https://www.kaggle.com/python10pm/pandas-exercises-with-solutions-2-3

Part three (solution from 43 - 75): https://www.kaggle.com/python10pm/pandas-exercises-with-solutions-3-3

In the future I plan to create a similar kernel on numpy, and compile the pandas tricks from the dataschool website.

https://www.dataschool.io/python-pandas-tips-and-tricks/

Hope you enjoy and learn a lot.

# Upvote if you find it useful

<a id='table_of_contents'></a>
# Table of contents

[1. How to import pandas and check the version?](#q1)

[2. How to create a series from a list, numpy array and dict?](#q2)

[3. How to convert the index of a series into a column of a dataframe?](#q3)

[4. How to combine many series to form a dataframe?](#q4)

[5. How to assign name to the series’ index?](#q5)

[6. How to get the items of series A not present in series B?](#q6)

[7. How to get the items not common to both series A and series B?](#q7)

[8. How to get the minimum, 25th percentile, median, 75th, and max of a numeric series?](#q8)

[9. How to get frequency counts of unique items of a series?](#q9)

[10. How to keep only top 2 most frequent values as it is and replace everything else as ‘Other’?](#q10)

[11. How to bin a numeric series to 10 groups of equal size?](#q11)

[12. How to convert a numpy array to a dataframe of given shape?](#q12)

[13. How to find the positions of numbers that are multiples of 3 from a series?](#q13)

[14. How to extract items at given positions from a series?](#q14)

[15. How to stack two series vertically and horizontally ?](#q15)

[16. How to get the positions of items of series A in another series B?](#q16)

[17. How to compute the mean squared error on a truth and predicted series?](#q17)

[18. How to convert the first character of each element in a series to uppercase?](#q18)

[19. How to calculate the number of characters in each word in a series?](#q19)

[20. How to compute difference of differences between consequtive numbers of a series?](#q20)

[21. How to convert a series of date-strings to a timeseries?](#q21)

[22. How to get the day of month, week number, day of year and day of week from a series of date strings?](#q22)

[23. How to convert year-month string to dates corresponding to the 4th day of the month?](#q23)

[24. How to filter words that contain atleast 2 vowels from a series?](#q24)

[25. How to filter valid emails from a series?](#q25)

[26. How to get the mean of a series grouped by another series?](#q26)

[27. How to compute the euclidean distance between two series?](#q27)

[28. How to find all the local maxima (or peaks) in a numeric series?](#q28)

[29. How to replace missing spaces in a string with the least frequent character?](#q29)

[30. How to create a TimeSeries starting ‘2000-01-01’ and 10 weekends (saturdays) after that having random numbers as values?](#q30)

[31. How to fill an intermittent time series so all missing dates show up with values of previous non-missing date?](#q31)

[32. How to compute the autocorrelations of a numeric series?](#q32)

[33. How to import only every nth row from a csv file to create a dataframe?](#q33)

[34. How to change column values when importing csv to a dataframe?](#q34)


To get the exercises 35 - 42 follow this link [Kernel 2/3 - exercises 35 -42](https://www.kaggle.com/python10pm/pandas-exercises-with-solutions-2-3)

To get the exercises 43 - 75 follow this link [Kernel 3/3 - exercises 43 -75](https://www.kaggle.com/python10pm/pandas-exercises-with-solutions-3-3)

In [1]:
# Allow several prints in one cell
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

# Pandas exercise

<a id='q1'></a>
**1. How to import pandas and check the version?**

[Go back to the table of contents](#table_of_contents)

In [2]:
# print here your solution
# unhide the next cell and check your result

In [3]:
import pandas as pd
print(pd.__version__)

# Print all pandas dependencies
print(pd.show_versions(as_json=True))

0.25.3
{'system': {'commit': None, 'python': '3.6.6.final.0', 'python-bits': 64, 'OS': 'Linux', 'OS-release': '4.9.0-11-amd64', 'machine': 'x86_64', 'processor': '', 'byteorder': 'little', 'LC_ALL': 'C.UTF-8', 'LANG': 'C.UTF-8', 'LOCALE': 'en_US.UTF-8'}, 'dependencies': {'pandas': '0.25.3', 'numpy': '1.17.4', 'pytz': '2019.3', 'dateutil': '2.8.0', 'pip': '19.3.1', 'setuptools': '42.0.1.post20191125', 'Cython': '0.29.14', 'pytest': '5.0.1', 'hypothesis': '4.50.6', 'sphinx': '2.2.1', 'blosc': None, 'feather': '0.4.0', 'xlsxwriter': '1.2.6', 'lxml.etree': '4.4.1', 'html5lib': '1.0.1', 'pymysql': None, 'psycopg2': None, 'jinja2': '2.10.3', 'IPython': '7.9.0', 'pandas_datareader': '0.8.1', 'bs4': '4.8.1', 'bottleneck': '1.3.1', 'fastparquet': None, 'gcsfs': None, 'matplotlib': '3.0.3', 'numexpr': '2.6.9', 'odfpy': None, 'openpyxl': '3.0.1', 'pandas_gbq': None, 'pyarrow': '0.15.1', 'pytables': None, 's3fs': '0.4.0', 'scipy': '1.3.3', 'sqlalchemy': '1.3.11', 'tables': '3.5.1', 'xarray': '0.14.1', 'xlrd': '1.2.0', 'xlwt': '1.3.0'}}
None

<a id = 'q2'></a>

**2. How to create a series from a list, numpy array and dict?**

Create a pandas series from each of the items below: a list, numpy and a dictionary

[Go back to the table of contents](#table_of_contents)

In [4]:
# Input
import numpy as np
a_list = list("abcdefg")
numpy_array = np.arange(1, 10)
dictionary = {"A":  0, "B":1, "C":2, "D":3, "E":5}

In [5]:
# print here your solution
# unhide the next cell and check your result

In [6]:
series1 = pd.Series(a_list)
print(series1)
series2 = pd.Series(numpy_array)
print(series2)
series3 = pd.Series(dictionary)
print(series3)

0    a
1    b
2    c
3    d
4    e
5    f
6    g
dtype: object
0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64
A    0
B    1
C    2
D    3
E    5
dtype: int64

<a id = 'q3'></a>
**3. How to convert the index of a series into a column of a dataframe?**

Convert the series ser into a dataframe with its index as another column on the dataframe.

[Go back to the table of contents](#table_of_contents)

In [7]:
# input
mylist = list('abcedfghijklmnopqrstuvwxyz')
myarr = np.arange(26)
mydict = dict(zip(mylist, myarr))
ser = pd.Series(mydict)
print(ser[:5])

a    0
b    1
c    2
e    3
d    4
dtype: int64

In [8]:
# print here your solution
# unhide the next cell and check your result

In [9]:
# solution 1 using DataFrame
ser_df = pd.DataFrame(ser)
ser_df.reset_index()

# using pandas to_frame()
ser_df = ser.to_frame().reset_index()
ser_df

   index   0
0      a   0
1      b   1
2      c   2
3      e   3
4      d   4
5      f   5
6      g   6
7      h   7
8      i   8
9      j   9
10     k  10
11     l  11
12     m  12
13     n  13
14     o  14
15     p  15
16     q  16
17     r  17
18     s  18
19     t  19
20     u  20
21     v  21
22     w  22
23     x  23
24     y  24
25     z  25

   index   0
0      a   0
1      b   1
2      c   2
3      e   3
4      d   4
5      f   5
6      g   6
7      h   7
8      i   8
9      j   9
10     k  10
11     l  11
12     m  12
13     n  13
14     o  14
15     p  15
16     q  16
17     r  17
18     s  18
19     t  19
20     u  20
21     v  21
22     w  22
23     x  23
24     y  24
25     z  25

<a id = 'q4'></a>
**4. How to combine many series to form a dataframe?**

Combine ser1 and ser2 to form a dataframe.

[Go back to the table of contents](#table_of_contents)

In [10]:
# input
ser1 = pd.Series(list('abcedfghijklmnopqrstuvwxyz'))
ser2 = pd.Series(np.arange(26))

In [11]:
# print here your solution
# unhide the next cell and check your result

In [12]:
# using pandas DataFrame
ser_df = pd.DataFrame(ser1, ser2).reset_index()
ser_df.head()
# using pandas DataFrame with a dictionary, gives a specific name to the column
ser_df = pd.DataFrame({"col1":ser1, "col2":ser2})
ser_df.head(5)
# using pandas concat
ser_df = pd.concat([ser1, ser2], axis = 1)
ser_df.head()

   index  0
0      0  a
1      1  b
2      2  c
3      3  e
4      4  d

  col1  col2
0    a     0
1    b     1
2    c     2
3    e     3
4    d     4

   0  1
0  a  0
1  b  1
2  c  2
3  e  3
4  d  4

<a id = 'q5'></a>
**5. How to assign name to the series’ index?**

Give a name to the series ser calling it ‘alphabets’.

[Go back to the table of contents](#table_of_contents)

In [13]:
# input
ser = pd.Series(list('abcedfghijklmnopqrstuvwxyz'))

In [14]:
# print here your solution
# unhide the next cell and check your result

In [15]:
# using series rename method
ser.rename("alphabets")
# using series attribute
ser.name = "other_name"
ser

0     a
1     b
2     c
3     e
4     d
5     f
6     g
7     h
8     i
9     j
10    k
11    l
12    m
13    n
14    o
15    p
16    q
17    r
18    s
19    t
20    u
21    v
22    w
23    x
24    y
25    z
Name: alphabets, dtype: object

0     a
1     b
2     c
3     e
4     d
5     f
6     g
7     h
8     i
9     j
10    k
11    l
12    m
13    n
14    o
15    p
16    q
17    r
18    s
19    t
20    u
21    v
22    w
23    x
24    y
25    z
Name: other_name, dtype: object

<a id = 'q6'></a>
**6. How to get the items of series A not present in series B?**

Get all items of ser1 and ser2 not common to both.

[Go back to the table of contents](#table_of_contents)

In [16]:
# input
ser1 = pd.Series([1, 2, 3, 4, 5])
ser2 = pd.Series([4, 5, 6, 7, 8])

In [17]:
# print here your solution
# unhide the next cell and check your result

In [18]:
ser1[~ser1.isin(ser2)]

0    1
1    2
2    3
dtype: int64

<a id = 'q7'></a>
**7. How to get the items not common to both series A and series B?**

Get all items of ser1 and ser2 not common to both.

[Go back to the table of contents](#table_of_contents)

In [19]:
# input
ser1 = pd.Series([1, 2, 3, 4, 5])
ser2 = pd.Series([4, 5, 6, 7, 8])

In [20]:
# print here your solution
# unhide the next cell and check your result

In [21]:
# using pandas
a_not_b = ser1[~ser1.isin(ser2)]
b_not_a = ser2[~ser2.isin(ser1)]
                          
a_not_b.append(b_not_a, ignore_index = True)

# using numpy union and intersection
ser_u = pd.Series(np.union1d(ser1, ser2))
ser_i = pd.Series(np.intersect1d(ser1, ser2))
ser_u[~ser_u.isin(ser_i)]

0    1
1    2
2    3
3    6
4    7
5    8
dtype: int64

0    1
1    2
2    3
5    6
6    7
7    8
dtype: int64

<a id = 'q8'></a>
**8. How to get the minimum, 25th percentile, median, 75th, and max of a numeric series?**

Compute the minimum, 25th percentile, median, 75th, and maximum of ser.

[Go back to the table of contents](#table_of_contents)

In [22]:
# input
state = np.random.RandomState(100)
ser = pd.Series(state.normal(10, 5, 25))

In [23]:
# print here your solution
# unhide the next cell and check your result

In [24]:
# using pandas
ser.describe()

# or using numpy
np.percentile(ser, q = [0, 25, 50, 75, 100])

count    25.000000
mean     10.435437
std       4.253118
min       1.251173
25%       7.709865
50%      10.922593
75%      13.363604
max      18.094908
dtype: float64

array([ 1.25117263,  7.70986507, 10.92259345, 13.36360403, 18.0949083 ])

<a id = 'q9'></a>
**9. How to get frequency counts of unique items of a series?**

Calculate the frequency counts of each unique value ser.

[Go back to the table of contents](#table_of_contents)

In [25]:
# input
ser = pd.Series(np.take(list('abcdefgh'), np.random.randint(8, size=30)))

In [26]:
# print here your solution
# unhide the next cell and check your result

In [27]:
ser.value_counts()

b    6
f    5
e    5
g    3
h    3
c    3
a    3
d    2
dtype: int64

<a id = 'q10'></a>
**10. How to keep only top 2 most frequent values as it is and replace everything else as ‘Other’?**

From ser, keep the top 2 most frequent items as it is and replace everything else as ‘Other’.

[Go back to the table of contents](#table_of_contents)

In [28]:
# input
np.random.RandomState(100)
ser = pd.Series(np.random.randint(1, 5, [12]))
ser

RandomState(MT19937) at 0x7F316F334468

0     4
1     1
2     4
3     4
4     2
5     3
6     1
7     4
8     1
9     2
10    3
11    1
dtype: int64

In [29]:
# print here your solution
# unhide the next cell and check your result

In [30]:
ser.value_counts()
ser[~ser.isin(ser.value_counts().index[:2])] = 'Other'
ser
# we do value_counts to see the repetitions for each value, then we do ~ser.isin value_counts, filter by index the first 2 and = "Other renames the values"

4    4
1    4
3    2
2    2
dtype: int64

0         4
1         1
2         4
3         4
4     Other
5     Other
6         1
7         4
8         1
9     Other
10    Other
11        1
dtype: object

<a id = 'q11'></a>
**11. How to bin a numeric series to 10 groups of equal size?**

Bin the series ser into 10 equal deciles and replace the values with the bin name.

[Go back to the table of contents](#table_of_contents)

In [31]:
# input
ser = pd.Series(np.random.random(20))
ser

0     0.115871
1     0.121806
2     0.054204
3     0.825146
4     0.163722
5     0.611774
6     0.042156
7     0.973116
8     0.291521
9     0.729026
10    0.798382
11    0.224555
12    0.357884
13    0.977743
14    0.644379
15    0.551175
16    0.710450
17    0.470541
18    0.889921
19    0.892088
dtype: float64

In [32]:
# print here your solution
# unhide the next cell and check your result

In [33]:
pd.qcut(ser, q = 10)
# we can also pass labels
pd.qcut(ser, q = [0, .10, .20, .30, .40, .50, .60, .70, .80, .90, 1], labels=['1st', '2nd', '3rd', '4th', '5th', '6th', '7th', '8th', '9th', '10th']).head()

0      (0.11, 0.155]
1      (0.11, 0.155]
2     (0.0412, 0.11]
3      (0.75, 0.838]
4     (0.155, 0.271]
5     (0.581, 0.671]
6     (0.0412, 0.11]
7       (0.9, 0.978]
8     (0.271, 0.425]
9      (0.671, 0.75]
10     (0.75, 0.838]
11    (0.155, 0.271]
12    (0.271, 0.425]
13      (0.9, 0.978]
14    (0.581, 0.671]
15    (0.425, 0.581]
16     (0.671, 0.75]
17    (0.425, 0.581]
18      (0.838, 0.9]
19      (0.838, 0.9]
dtype: category
Categories (10, interval[float64]): [(0.0412, 0.11] < (0.11, 0.155] < (0.155, 0.271] < (0.271, 0.425] ... (0.671, 0.75] < (0.75, 0.838] < (0.838, 0.9] < (0.9, 0.978]]

0    2nd
1    2nd
2    1st
3    8th
4    3rd
dtype: category
Categories (10, object): [1st < 2nd < 3rd < 4th ... 7th < 8th < 9th < 10th]

<a id = 'q12'></a>
**12. How to convert a numpy array to a dataframe of given shape? (L1)**

Reshape the series ser into a dataframe with 7 rows and 5 columns

[Go back to the table of contents](#table_of_contents)

In [34]:
# input
ser = pd.Series(np.random.randint(1, 10, 35))
ser

0     3
1     5
2     1
3     4
4     8
5     8
6     9
7     9
8     1
9     8
10    9
11    4
12    8
13    7
14    2
15    9
16    4
17    2
18    5
19    7
20    8
21    2
22    8
23    8
24    7
25    4
26    2
27    7
28    5
29    1
30    4
31    4
32    4
33    8
34    8
dtype: int64

In [35]:
# print here your solution
# unhide the next cell and check your result

In [36]:
# using numpy
pd.DataFrame(np.array(ser).reshape(7, 5))

# using only pandas
pd.DataFrame(ser.values.reshape(7, 5))

   0  1  2  3  4
0  3  5  1  4  8
1  8  9  9  1  8
2  9  4  8  7  2
3  9  4  2  5  7
4  8  2  8  8  7
5  4  2  7  5  1
6  4  4  4  8  8

   0  1  2  3  4
0  3  5  1  4  8
1  8  9  9  1  8
2  9  4  8  7  2
3  9  4  2  5  7
4  8  2  8  8  7
5  4  2  7  5  1
6  4  4  4  8  8

<a id = 'q13'></a>
**13. How to find the positions of numbers that are multiples of 3 from a series?**

Find the positions of numbers that are multiples of 3 from ser.

[Go back to the table of contents](#table_of_contents)

In [37]:
# input

np.random.RandomState(100)
ser = pd.Series(np.random.randint(1, 5, 10))
ser

RandomState(MT19937) at 0x7F316F334468

0    2
1    3
2    3
3    2
4    3
5    4
6    3
7    4
8    1
9    3
dtype: int64

In [38]:
# print here your solution
# unhide the next cell and check your result

In [39]:
# using the where clause
ser.where(lambda x: x%3 == 0).dropna()

# using numpy and reshape to get a pandas series
#pd.Series(np.argwhere(ser%3 == 0).reshape(4))
np.argwhere(ser%3 == 0)

1    3.0
2    3.0
4    3.0
6    3.0
9    3.0
dtype: float64

/opt/conda/lib/python3.6/site-packages/numpy/core/fromnumeric.py:61: FutureWarning: Series.nonzero() is deprecated and will be removed in a future version.Use Series.to_numpy().nonzero() instead
  return bound(*args, **kwds)

array([[1],
       [2],
       [4],
       [6],
       [9]])

<a id = 'q14'></a>
**14. How to extract items at given positions from a series**

From ser, extract the items at positions in list pos.

[Go back to the table of contents](#table_of_contents)

In [40]:
# input

ser = pd.Series(list('abcdefghijklmnopqrstuvwxyz'))
pos = [0, 4, 8, 14, 20]

In [41]:
# print here your solution
# unhide the next cell and check your result

In [42]:
# using loc
ser.loc[pos]

# using series take
ser.take(pos)

0     a
4     e
8     i
14    o
20    u
dtype: object

0     a
4     e
8     i
14    o
20    u
dtype: object

<a id = 'q15'></a>

**15. How to stack two series vertically and horizontally ?**

Stack ser1 and ser2 vertically and horizontally (to form a dataframe).

[Go back to the table of contents](#table_of_contents)

In [43]:
# input
ser1 = pd.Series(range(5))
ser2 = pd.Series(list('abcde'))

In [44]:
# print here your solution
# unhide the next cell and check your result

In [45]:
# vertical
ser1.append(ser2)
# or using pandas concat and axis = 0
pd.concat([ser1, ser2], axis = 0)

# horizontal
pd.concat([ser1, ser2], axis = 1)

0    0
1    1
2    2
3    3
4    4
0    a
1    b
2    c
3    d
4    e
dtype: object

0    0
1    1
2    2
3    3
4    4
0    a
1    b
2    c
3    d
4    e
dtype: object

   0  1
0  0  a
1  1  b
2  2  c
3  3  d
4  4  e

<a id = 'q16'></a>
**16. How to get the positions of items of series A in another series B?**

Get the positions of items of ser2 in ser1 as a list.

[Go back to the table of contents](#table_of_contents)

In [46]:
# input
ser1 = pd.Series([10, 9, 6, 5, 3, 1, 12, 8, 13])
ser2 = pd.Series([1, 3, 10, 13])

In [47]:
# print here your solution
# unhide the next cell and check your result

In [48]:
# get's the index, but it's sorts the index
list(ser1[ser1.isin(ser2)].index)

# using numpy where
[np.where(i == ser1)[0].tolist()[0] for i in ser2]

# using pandas Index and get location
[pd.Index(ser1).get_loc(i) for i in ser2]

[0, 4, 5, 8]

[5, 4, 0, 8]

[5, 4, 0, 8]

<a id = 'q17'></a>
**17. How to compute the mean squared error on a truth and predicted series?**

Compute the mean squared error of truth and pred series.

[Go back to the table of contents](#table_of_contents)

In [49]:
# input
truth = pd.Series(range(10))
pred = pd.Series(range(10)) + np.random.random(10)

In [50]:
# print here your solution
# unhide the next cell and check your result

In [51]:
# BAD, don't use it
(np.mean([(truth_i - pred_i)**2 for truth_i, pred_i in zip(truth, pred)]))

# using numpy
np.mean((truth-pred)**2)

# using sklear metrics
from sklearn.metrics import mean_squared_error
mean_squared_error(truth, pred)

0.40349109945583395

0.40349109945583395

0.40349109945583395

<a id = 'q18'></a>

**18. How to convert the first character of each element in a series to uppercase?**

Change the first character of each word to upper case in each word of ser.

[Go back to the table of contents](#table_of_contents)

In [52]:
# input
ser = pd.Series(['just', 'a', 'random', 'list'])
ser

0      just
1         a
2    random
3      list
dtype: object

In [53]:
# print here your solution
# unhide the next cell and check your result

In [54]:
# using python string method title() Assumes we only encounter string in the list
[i.title() for i in ser]

# using lambda
ser.map(lambda x: x.title())

# other solution
ser.map(lambda x: x[0].upper() + x[1:])

['Just', 'A', 'Random', 'List']

0      Just
1         A
2    Random
3      List
dtype: object

0      Just
1         A
2    Random
3      List
dtype: object

<a id = 'q19'></a>

**19. How to calculate the number of characters in each word in a series?**

[Go back to the table of contents](#table_of_contents)

In [55]:
# input
ser = pd.Series(['just', 'a', 'random', 'list'])

In [56]:
# print here your solution
# unhide the next cell and check your result

In [57]:
# using list comprehension
[len(i) for i in ser]

# using series map
ser.map(len)

# using series apply
ser.apply(len)

[4, 1, 6, 4]

0    4
1    1
2    6
3    4
dtype: int64

0    4
1    1
2    6
3    4
dtype: int64

<a id = 'q20'></a>
**20. How to compute difference of differences between consequtive numbers of a series?**

Difference of differences between the consequtive numbers of ser.

[Go back to the table of contents](#table_of_contents)

In [58]:
# input
ser = pd.Series([1, 3, 6, 10, 15, 21, 27, 35])

# Desired Output
# [nan, 2.0, 3.0, 4.0, 5.0, 6.0, 6.0, 8.0]
# [nan, nan, 1.0, 1.0, 1.0, 1.0, 0.0, 2.0]

In [59]:
# print here your solution
# unhide the next cell and check your result

In [60]:
# using pandas diff()
ser.diff(periods = 1).tolist()
ser.diff(periods = 1).diff(periods = 1).tolist()

[nan, 2.0, 3.0, 4.0, 5.0, 6.0, 6.0, 8.0]

[nan, nan, 1.0, 1.0, 1.0, 1.0, 0.0, 2.0]

<a id = 'q21'></a>

**21. How to convert a series of date-strings to a timeseries?**

[Go back to the table of contents](#table_of_contents)

In [61]:
# input
ser = pd.Series(['01 Jan 2010', '02-02-2011', '20120303', '2013/04/04', '2014-05-05', '2015-06-06T12:20'])


'''
Desired Output

0   2010-01-01 00:00:00
1   2011-02-02 00:00:00
2   2012-03-03 00:00:00
3   2013-04-04 00:00:00
4   2014-05-05 00:00:00
5   2015-06-06 12:20:00
'''

'\nDesired Output\n\n0   2010-01-01 00:00:00\n1   2011-02-02 00:00:00\n2   2012-03-03 00:00:00\n3   2013-04-04 00:00:00\n4   2014-05-05 00:00:00\n5   2015-06-06 12:20:00\n'

In [62]:
# print here your solution
# unhide the next cell and check your result

In [63]:
# using pands to_datetime
pd.to_datetime(ser)

# using dateutil parse
from dateutil.parser import parse
ser.map(lambda x: parse(x))

0   2010-01-01 00:00:00
1   2011-02-02 00:00:00
2   2012-03-03 00:00:00
3   2013-04-04 00:00:00
4   2014-05-05 00:00:00
5   2015-06-06 12:20:00
dtype: datetime64[ns]

0   2010-01-01 00:00:00
1   2011-02-02 00:00:00
2   2012-03-03 00:00:00
3   2013-04-04 00:00:00
4   2014-05-05 00:00:00
5   2015-06-06 12:20:00
dtype: datetime64[ns]

<a id = 'q22'></a>
**22. How to get the day of month, week number, day of year and day of week from a series of date strings?**

Get the day of month, week number, day of year and day of week from ser.

[Go back to the table of contents](#table_of_contents)

In [64]:
# input
ser = pd.Series(['01 Jan 2010', '02-02-2011', '20120303', '2013/04/04', '2014-05-05', '2015-06-06T12:20'])

'''
Desired output

Date:  [1, 2, 3, 4, 5, 6]
Week number:  [53, 5, 9, 14, 19, 23]
Day num of year:  [1, 33, 63, 94, 125, 157]
Day of week:  ['Friday', 'Wednesday', 'Saturday', 'Thursday', 'Monday', 'Saturday']
'''

"\nDesired output\n\nDate:  [1, 2, 3, 4, 5, 6]\nWeek number:  [53, 5, 9, 14, 19, 23]\nDay num of year:  [1, 33, 63, 94, 125, 157]\nDay of week:  ['Friday', 'Wednesday', 'Saturday', 'Thursday', 'Monday', 'Saturday']\n"

In [65]:
# print here your solution
# unhide the next cell and check your result

In [66]:
# day
pd.to_datetime(ser).dt.day.to_list()
# week
pd.to_datetime(ser).dt.week.to_list()
# another method
pd.to_datetime(ser).dt.weekofyear.to_list()
# day of year
pd.to_datetime(ser).dt.dayofyear.to_list()
# day of week in words
week_dict = {0:"Monday", 1:"Tuesday", 2:"Wednesday", 3:"Thursday", 4:"Friday", 5:"Saturday", 6:"Sunday"}
pd.to_datetime(ser).dt.dayofweek.map(week_dict).to_list()
# another method
pd.to_datetime(ser).dt.weekday_name.to_list()

[1, 2, 3, 4, 5, 6]

[53, 5, 9, 14, 19, 23]

[53, 5, 9, 14, 19, 23]

[1, 33, 63, 94, 125, 157]

['Friday', 'Wednesday', 'Saturday', 'Thursday', 'Monday', 'Saturday']

['Friday', 'Wednesday', 'Saturday', 'Thursday', 'Monday', 'Saturday']

<a id = 'q23'></a>

**23. How to convert year-month string to dates corresponding to the 4th day of the month?**

Change ser to dates that start with 4th of the respective months.

[Go back to the table of contents](#table_of_contents)

In [67]:
# input
ser = pd.Series(['Jan 2010', 'Feb 2011', 'Mar 2012'])

'''
Desired Output

0   2010-01-04
1   2011-02-04
2   2012-03-04
dtype: datetime64[ns]

'''

'\nDesired Output\n\n0   2010-01-04\n1   2011-02-04\n2   2012-03-04\ndtype: datetime64[ns]\n\n'

In [68]:
# print here your solution
# unhide the next cell and check your result

In [69]:
# solution using parser
from dateutil.parser import parse
ser.map(lambda x: parse('04 ' + x))

# another solution

from dateutil.parser import parse
# Parse the date
ser_ts = ser.map(lambda x: parse(x))

# Construct date string with date as 4
ser_datestr = ser_ts.dt.year.astype('str') + '-' + ser_ts.dt.month.astype('str') + '-' + '04'

# Format it.
[parse(i).strftime('%Y-%m-%d') for i in ser_datestr]

0   2010-01-04
1   2011-02-04
2   2012-03-04
dtype: datetime64[ns]

['2010-01-04', '2011-02-04', '2012-03-04']

<a id = 'q24'></a>

**24. How to filter words that contain atleast 2 vowels from a series?**

From ser, extract words that contain atleast 2 vowels.

[Go back to the table of contents](#table_of_contents)

In [70]:
# input
ser = pd.Series(['Apple', 'Orange', 'Plan', 'Python', 'Money'])

'''
Desired Output


0     Apple
1    Orange
4     Money
dtype: object
'''

'\nDesired Output\n\n\n0     Apple\n1    Orange\n4     Money\ndtype: object\n'

In [71]:
# print here your solution
# unhide the next cell and check your result

In [72]:
# using nested loops
vowels = list("aeiou")
list_ = []
for w in ser:
    c = 0
    for l in list(w.lower()):
        if l in vowels:
            c += 1
    if c >= 2:
        print(w)
        list_.append(w)

ser[ser.isin(list_)]

# another solution using counter

from collections import Counter
mask = ser.map(lambda x: sum([Counter(x.lower()).get(i, 0) for i in list('aeiou')]) >= 2)
ser[mask]

Apple
Orange
Money

0     Apple
1    Orange
4     Money
dtype: object

0     Apple
1    Orange
4     Money
dtype: object

<a id = 'q25'></a>

**25. How to filter valid emails from a series?**

Extract the valid emails from the series emails. The regex pattern for valid emails is provided as reference.

[Go back to the table of contents](#table_of_contents)

In [73]:
# input
emails = pd.Series(['buying books at amazom.com', 'rameses@egypt.com', 'matt@t.co', 'narendra@modi.com'])
pattern ='[A-Za-z0-9._%+-]+@[A-Za-z0-9.-]+\\.[A-Za-z]{2,4}'

'''
Desired Output

1    rameses@egypt.com
2            matt@t.co
3    narendra@modi.com
dtype: object
'''

'\nDesired Output\n\n1    rameses@egypt.com\n2            matt@t.co\n3    narendra@modi.com\ndtype: object\n'

In [74]:
# print here your solution
# unhide the next cell and check your result

In [75]:
# using powerful regex
import re
re_ = re.compile(pattern)
emails[emails.str.contains(pat = re_, regex = True)]

# other solutions
pattern ='[A-Za-z0-9._%+-]+@[A-Za-z0-9.-]+\\.[A-Za-z]{2,4}'
mask = emails.map(lambda x: bool(re.match(pattern, x)))
emails[mask]

# using str.findall
emails.str.findall(pattern, flags=re.IGNORECASE)

# using list comprehension
[x[0] for x in [re.findall(pattern, email) for email in emails] if len(x) > 0]

1    rameses@egypt.com
2            matt@t.co
3    narendra@modi.com
dtype: object

1    rameses@egypt.com
2            matt@t.co
3    narendra@modi.com
dtype: object

0                     []
1    [rameses@egypt.com]
2            [matt@t.co]
3    [narendra@modi.com]
dtype: object

['rameses@egypt.com', 'matt@t.co', 'narendra@modi.com']

<a id = 'q26'></a>

**26. How to get the mean of a series grouped by another series?**

Compute the mean of weights of each fruit.

[Go back to the table of contents](#table_of_contents)

In [76]:
# doesn't incluide the upper limit
fruit = pd.Series(np.random.choice(['apple', 'banana', 'carrot'], 10))
fruit
weights = pd.Series(np.linspace(1, 10, 10))
weights
#print(weights.tolist())
#print(fruit.tolist())

'''
Desired output

# values can change due to randomness
apple     6.0
banana    4.0
carrot    5.8
dtype: float64
'''

0    carrot
1    carrot
2    carrot
3     apple
4     apple
5    banana
6    carrot
7    carrot
8    banana
9    carrot
dtype: object

0     1.0
1     2.0
2     3.0
3     4.0
4     5.0
5     6.0
6     7.0
7     8.0
8     9.0
9    10.0
dtype: float64

'\nDesired output\n\n# values can change due to randomness\napple     6.0\nbanana    4.0\ncarrot    5.8\ndtype: float64\n'

In [77]:
# print here your solution
# unhide the next cell and check your result

In [78]:
# using pandas groupby
df = pd.concat([fruit, weights], axis = 1)
df
df.groupby(0).mean()

# use one list to calculate a kpi from another
weights.groupby(fruit).mean()

        0     1
0  carrot   1.0
1  carrot   2.0
2  carrot   3.0
3   apple   4.0
4   apple   5.0
5  banana   6.0
6  carrot   7.0
7  carrot   8.0
8  banana   9.0
9  carrot  10.0

               1
0
apple   4.500000
banana  7.500000
carrot  5.166667

apple     4.500000
banana    7.500000
carrot    5.166667
dtype: float64

<a id = 'q27'></a>

**27. How to compute the euclidean distance between two series?**

Compute the [euclidean distance](https://en.wikipedia.org/wiki/Euclidean_distance) between series (points) p and q, without using a packaged formula.

[Go back to the table of contents](#table_of_contents)

In [79]:
# Input
p = pd.Series([1, 2, 3, 4, 5, 6, 7, 8, 9, 10])
q = pd.Series([10, 9, 8, 7, 6, 5, 4, 3, 2, 1])
'''
Desired Output

18.165
'''

'\nDesired Output\n\n18.165\n'

In [80]:
# print here your solution
# unhide the next cell and check your result

In [81]:
# using list comprehension
suma = np.sqrt(np.sum([(p - q)**2 for p, q in zip(p, q)]))
suma

# using series one to one operation
sum((p - q)**2)**.5

# using numpy
np.linalg.norm(p-q)

18.16590212458495

18.16590212458495

18.16590212458495

<a id = 'q28'></a>

**28. How to find all the local maxima (or peaks) in a numeric series?**

[Go back to the table of contents](#table_of_contents)

In [82]:
# input
ser = pd.Series([2, 10, 3, 4, 9, 10, 2, 7, 3])

'''
Desired output

array([1, 5, 7])
'''

'\nDesired output\n\narray([1, 5, 7])\n'

In [83]:
# print here your solution
# unhide the next cell and check your result

In [84]:
# using pandas shift
local_max = ser[(ser.shift(1) < ser) & (ser.shift(-1) < ser)]
local_max.index

# using numpy
dd = np.diff(np.sign(np.diff(ser)))
dd
peak_locs = np.where(dd == -2)[0] + 1
peak_locs

Int64Index([1, 5, 7], dtype='int64')

array([-2,  2,  0,  0, -2,  2, -2])

array([1, 5, 7])

<a id = 'q29'></a>

**29. How to replace missing spaces in a string with the least frequent character?**

Replace the spaces in my_str with the least frequent character.

[Go back to the table of contents](#table_of_contents)

In [85]:
# input
my_str = 'dbc deb abed ggade'

'''
Desired Output

'dbccdebcabedcggade'  # least frequent is 'c'
'''

"\nDesired Output\n\n'dbccdebcabedcggade'  # least frequent is 'c'\n"

In [86]:
# print here your solution
# unhide the next cell and check your result

In [87]:
# using Counter
from collections import Counter
my_str_ = my_str
Counter_ = Counter(list(my_str_.replace(" ", "")))
Counter_
minimum = min(Counter_, key = Counter_.get)

print(my_str.replace(" ", minimum))

# using pandas
ser = pd.Series(list(my_str.replace(" ", "")))
ser.value_counts()
minimum = list(ser.value_counts().index)[-1]
minimum
print(my_str.replace(" ", minimum))

Counter({'d': 4, 'b': 3, 'c': 1, 'e': 3, 'a': 2, 'g': 2})

dbccdebcabedcggade

d    4
b    3
e    3
g    2
a    2
c    1
dtype: int64

'c'

dbccdebcabedcggade

<a id = 'q30'></a>

**30. How to create a TimeSeries starting ‘2000-01-01’ and 10 weekends (saturdays) after that having random numbers as values?**

[Go back to the table of contents](#table_of_contents)

In [88]:
'''
Desired Output
values can be random

2000-01-01    4
2000-01-08    1
2000-01-15    8
2000-01-22    4
2000-01-29    4
2000-02-05    2
2000-02-12    4
2000-02-19    9
2000-02-26    6
2000-03-04    6
'''

'\nDesired Output\nvalues can be random\n\n2000-01-01    4\n2000-01-08    1\n2000-01-15    8\n2000-01-22    4\n2000-01-29    4\n2000-02-05    2\n2000-02-12    4\n2000-02-19    9\n2000-02-26    6\n2000-03-04    6\n'

In [89]:
# print here your solution
# unhide the next cell and check your result

In [90]:
dti = pd.Series(pd.date_range('2000-01-01', periods=10, freq='W-SAT'))
random_num = pd.Series([np.random.randint(1, 10) for i in range(10)])


df = pd.concat({"Time":dti, "Numbers":random_num}, axis = 1)
df

# for more about time series functionality 
# https://pandas.pydata.org/pandas-docs/stable/user_guide/timeseries.html#timeseries-offset-aliases

# another solution just using pandas Series
ser = pd.Series(np.random.randint(1,10,10), pd.date_range('2000-01-01', periods=10, freq='W-SAT'))
ser

        Time  Numbers
0 2000-01-01        7
1 2000-01-08        3
2 2000-01-15        9
3 2000-01-22        6
4 2000-01-29        6
5 2000-02-05        9
6 2000-02-12        8
7 2000-02-19        2
8 2000-02-26        6
9 2000-03-04        5

2000-01-01    5
2000-01-08    8
2000-01-15    8
2000-01-22    7
2000-01-29    2
2000-02-05    5
2000-02-12    7
2000-02-19    3
2000-02-26    1
2000-03-04    2
Freq: W-SAT, dtype: int64

<a id = 'q31'></a>

**31. How to fill an intermittent time series so all missing dates show up with values of previous non-missing date?**

ser has missing dates and values. Make all missing dates appear and fill up with value from previous date.

[Go back to the table of contents](#table_of_contents)

In [91]:
# input
ser = pd.Series([1,10,3,np.nan], index=pd.to_datetime(['2000-01-01', '2000-01-03', '2000-01-06', '2000-01-08']))

'''
Desired Output

2000-01-01     1.0
2000-01-02     1.0
2000-01-03    10.0
2000-01-04    10.0
2000-01-05    10.0
2000-01-06     3.0
2000-01-07     3.0
2000-01-08     NaN
'''

'\nDesired Output\n\n2000-01-01     1.0\n2000-01-02     1.0\n2000-01-03    10.0\n2000-01-04    10.0\n2000-01-05    10.0\n2000-01-06     3.0\n2000-01-07     3.0\n2000-01-08     NaN\n'

In [92]:
# print here your solution
# unhide the next cell and check your result

In [93]:
# Solution 1
# first let's fill the missing dates
indx = pd.date_range("2000-01-01", "2000-01-08")
# now let's reindex the series ser with the new index
# we have to reasing back to ser
ser = ser.reindex(indx)
# lastly let's populate the missing values
ser.fillna(method = "ffill")

# Solution 2
ser = pd.Series([1,10,3,np.nan], index=pd.to_datetime(['2000-01-01', '2000-01-03', '2000-01-06', '2000-01-08']))
ser.resample('D').ffill()  # fill with previous value
ser.resample('D').bfill()  # fill with next value
ser.resample('D').bfill().ffill()  # fill next else prev value

2000-01-01     1.0
2000-01-02     1.0
2000-01-03    10.0
2000-01-04    10.0
2000-01-05    10.0
2000-01-06     3.0
2000-01-07     3.0
2000-01-08     3.0
Freq: D, dtype: float64

2000-01-01     1.0
2000-01-02     1.0
2000-01-03    10.0
2000-01-04    10.0
2000-01-05    10.0
2000-01-06     3.0
2000-01-07     3.0
2000-01-08     NaN
Freq: D, dtype: float64

2000-01-01     1.0
2000-01-02    10.0
2000-01-03    10.0
2000-01-04     3.0
2000-01-05     3.0
2000-01-06     3.0
2000-01-07     NaN
2000-01-08     NaN
Freq: D, dtype: float64

2000-01-01     1.0
2000-01-02    10.0
2000-01-03    10.0
2000-01-04     3.0
2000-01-05     3.0
2000-01-06     3.0
2000-01-07     3.0
2000-01-08     3.0
Freq: D, dtype: float64

<a id = 'q32'></a>

**32. How to compute the autocorrelations of a numeric series?**

Compute autocorrelations for the first 10 lags of ser. Find out which lag has the largest correlation.

[Go back to the table of contents](#table_of_contents)

In [94]:
# input
ser = pd.Series(np.arange(20) + np.random.normal(1, 10, 20))

'''
Desired Output

# values will change due to randomness
[0.29999999999999999, -0.11, -0.17000000000000001, 0.46000000000000002, 0.28000000000000003, -0.040000000000000001, -0.37, 0.41999999999999998, 0.47999999999999998, 0.17999999999999999]
Lag having highest correlation:  9
'''

'\nDesired Output\n\n# values will change due to randomness\n[0.29999999999999999, -0.11, -0.17000000000000001, 0.46000000000000002, 0.28000000000000003, -0.040000000000000001, -0.37, 0.41999999999999998, 0.47999999999999998, 0.17999999999999999]\nLag having highest correlation:  9\n'

In [95]:
# print here your solution
# unhide the next cell and check your result

In [96]:
# using pandas autocorr
# ser.autocorr(lag = 10)

# solution using list comprehension
autocorrelations = [ser.autocorr(i).round(2) for i in range(11)]
print(autocorrelations[1:])
print('Lag having highest correlation: ', np.argmax(np.abs(autocorrelations[1:]))+1)

[-0.07, 0.13, -0.05, 0.0, 0.19, 0.2, -0.06, -0.08, -0.33, -0.31]
Lag having highest correlation:  9

<a id = 'q33'></a>

**33. How to import only every nth row from a csv file to create a dataframe?**

Import every 50th row of BostonHousing dataset as a dataframe.

[Go back to the table of contents](#table_of_contents)

In [97]:
# input
import os
for dirname, _, filenames in os.walk('/kaggle/input'):
    for filename in filenames:
        print(os.path.join(dirname, filename))

/kaggle/input/boston-house-prices/housing.csv

In [98]:
# print here your solution
# unhide the next cell and check your result

In [99]:
# data comes without headers, but we searched for it
names = ['CRIM', 'ZN', 'INDUS', 'CHAS', 'NOX', 'RM', 'AGE', 'DIS', 'RAD', 'TAX', 'PTRATIO', 'B', 'LSTAT', 'MEDV']

# pure Python implementation
with open("/kaggle/input/boston-house-prices/housing.csv") as f:
    data = f.read()
    nth_rows = []
    for i, rows in enumerate(data.split("\n")):
        if i%50 == 0:
            nth_rows.append(rows)
            
# nth_rows is a list of strings separated by blank spaces " "
# the next list comprehension will do the trick

nth_rows[0]
data_ = [nth_rows[i].split() for i in range(len(nth_rows))]
df = pd.DataFrame(data_, columns=names)
df

# other solutions

# Solution 2: Use chunks and for-loop
# df = pd.read_csv("/kaggle/input/boston-house-prices/housing.csv", chunksize=50)
# df2 = pd.DataFrame()
# for chunk in df:
#     df2 = df2.append(chunk.iloc[0,:])
# df2

# Solution 3: Use chunks and list comprehension
# df = pd.read_csv("/kaggle/input/boston-house-prices/housing.csv", chunksize=50)
# df2 = pd.concat([chunk.iloc[0] for chunk in df], axis=1)
# df2 = df2.transpose()
# df2

' 0.00632  18.00   2.310  0  0.5380  6.5750  65.20  4.0900   1  296.0  15.30 396.90   4.98  24.00'

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.00,2.310,0,0.5380,6.5750,65.20,4.0900,1,296.0,15.30,396.90,4.98,24.00
1,0.08873,21.00,5.640,0,0.4390,5.9630,45.70,6.8147,4,243.0,16.80,395.56,13.45,19.70
2,0.14866,0.00,8.560,0,0.5200,6.7270,79.90,2.7778,5,384.0,20.90,394.76,9.42,27.50
3,1.65660,0.00,19.580,0,0.8710,6.1220,97.30,1.6180,5,403.0,14.70,372.80,14.10,21.50
4,0.01778,95.00,1.470,0,0.4030,7.1350,13.90,7.6534,3,402.0,17.00,384.30,4.45,32.90
5,0.14030,22.00,5.860,0,0.4310,6.4870,13.00,7.3967,7,330.0,19.10,396.28,5.90,24.40
6,0.04417,70.00,2.240,0,0.4000,6.8710,47.40,7.8278,5,358.0,14.80,390.86,6.07,24.80
7,0.06211,40.00,1.250,0,0.4290,6.4900,44.40,8.7921,1,335.0,19.70,396.90,5.98,22.90
8,25.04610,0.00,18.100,0,0.6930,5.9870,100.00,1.5888,24,666.0,20.20,396.90,26.77,5.60
9,6.71772,0.00,18.100,0,0.7130,6.7490,92.60,2.3236,24,666.0,20.20,0.32,17.44,13.40
10,0.22438,0.00,9.690,0,0.5850,6.0270,79.70,2.4982,6,391.0,19.20,396.90,14.33,16.80

<a id = 'q34'></a>

**34. How to change column values when importing csv to a dataframe?**

Import the boston housing dataset, but while importing change the 'medv' (median house value) column so that values < 25 becomes ‘Low’ and > 25 becomes ‘High’.

[Go back to the table of contents](#table_of_contents)

In [100]:
# input
import os
for dirname, _, filenames in os.walk('/kaggle/input'):
    for filename in filenames:
        print(os.path.join(dirname, filename))

/kaggle/input/boston-house-prices/housing.csv

In [101]:
# print here your solution
# unhide the next cell and check your result

In [102]:
# first let's import using the previuos code and save as a normal csv

names = ['CRIM', 'ZN', 'INDUS', 'CHAS', 'NOX', 'RM', 'AGE', 'DIS', 'RAD', 'TAX', 'PTRATIO', 'B', 'LSTAT', 'MEDV']
with open("/kaggle/input/boston-house-prices/housing.csv") as f:
    data = f.read()
    nth_rows = []
    for i, rows in enumerate(data.split("\n")):
        nth_rows.append(rows)

data_ = [nth_rows[i].split() for i in range(len(nth_rows))]

df = pd.DataFrame(data_, columns=names)
df.head()
df.to_csv("housing_preprocessed.csv")
del df

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.00,2.310,0,0.5380,6.5750,65.20,4.0900,1,296.0,15.30,396.90,4.98,24.00
1,0.02731,0.00,7.070,0,0.4690,6.4210,78.90,4.9671,2,242.0,17.80,396.90,9.14,21.60
2,0.02729,0.00,7.070,0,0.4690,7.1850,61.10,4.9671,2,242.0,17.80,392.83,4.03,34.70
3,0.03237,0.00,2.180,0,0.4580,6.9980,45.80,6.0622,3,222.0,18.70,394.63,2.94,33.40
4,0.06905,0.00,2.180,0,0.4580,7.1470,54.20,6.0622,3,222.0,18.70,396.90,5.33,36.20

In [103]:
# now let's start importing as normal and use converters to convert the values
# skipfooter because we had the last rows with nan values and index_col to specify that the first column is the index
df = pd.read_csv("housing_preprocessed.csv",  index_col = 0, skipfooter=1,  converters = {"MEDV": lambda x: "HIGH" if float(x) >= 25 else "LOW"})
df

/opt/conda/lib/python3.6/site-packages/ipykernel_launcher.py:3: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support skipfooter; you can avoid this warning by specifying engine='python'.
  This is separate from the ipykernel package so we can avoid doing imports until

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296.0,15.3,396.90,4.98,LOW
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242.0,17.8,396.90,9.14,LOW
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242.0,17.8,392.83,4.03,HIGH
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222.0,18.7,394.63,2.94,HIGH
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222.0,18.7,396.90,5.33,HIGH
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
501,0.06263,0.0,11.93,0,0.573,6.593,69.1,2.4786,1,273.0,21.0,391.99,9.67,LOW
502,0.04527,0.0,11.93,0,0.573,6.120,76.7,2.2875,1,273.0,21.0,396.90,9.08,LOW
503,0.06076,0.0,11.93,0,0.573,6.976,91.0,2.1675,1,273.0,21.0,396.90,5.64,LOW
504,0.10959,0.0,11.93,0,0.573,6.794,89.3,2.3889,1,273.0,21.0,393.45,6.48,LOW
505,0.04741,0.0,11.93,0,0.573,6.030,80.8,2.5050,1,273.0,21.0,396.90,7.88,LOW

# To be continued in [Part II](https://www.kaggle.com/python10pm/pandas-exercises-with-solutions-2-3) and [Part III](https://www.kaggle.com/python10pm/pandas-exercises-with-solutions-3-3)
# Please Upvote if you found it useful